<script>
export default {
  name: "Info"
}
</script>

<template>
  <div class="content-header">
    <div class="container-fluid">
      <div class="row mb-2">
        <div class="col-sm-6">
          <h1 class="m-0">
            Как пользоваться                    </h1>
        </div><!-- /.col -->
        <div class="col-sm-6">
        </div><!-- /.col -->
      </div><!-- /.row -->
    </div><!-- /.container-fluid -->
  </div>
  <div class="content">
    <br class="site-login" style="margin-left: 0px; font-size: 16px;">
    <h1>Как подключить Wildberries к платформе</h1>
    <p>1. Необходимо зайти в ваш аккаунт на сайте <a href="https://seller.wildberries.ru" target="_blank">seller.wildberries.ru</a><br>
      2. В личном кабинете нажмите на имя профиля и выберите Настройки → Доступ к API. ( или <a href="https://seller.wildberries.ru/supplier-settings/access-to-api" target="_blank">нажмите</a> )<br>
      3. Выберите, с какими категориями API вы будете работать с этим токеном.(рекомендуем выбрать все категории для корректной работы)<br>
      4. Нажмите Создать токен.<br>
      5. Скопируйте и сохраните токен в безопасном месте. Потом его нельзя будет посмотреть в личном кабинете. Если вы потеряли токен, создайте новый.<br>
      6. Добавьте токен на нашей платформе в Профиль → Личный кабинет → WB API KEY<br>
      7. Нажмите сохранить<br></p>
    <p><span style="color: green">Готово!</span> Теперь вам доступна возможность загрузки статистики из Wildberries и дальнейшей рабоы с ней</p>
    <p>Проверить активацию токена на платформе можно перейдя в Профиль → Мои API ключи</p><br>

    <h1>Как подтянуть информацию из WB</h1>
    <p>1. Необходимо перейди в раздел "Статистика" → "Запросить отчёт"<br>
      2. Выбрать период дат за который вы ходите загрузить отчет (советуем выбирать максимальный что бы сразу видеть всю информацию)<br>
      3. Нажать на кнопку "Запросить" и подождать пока произойдет загрузка.<br>
      4. При завершенной обработке запроса вам покажется уведомление с "Успехом" либо "Ошибкой"<br><br>
      p.s Возможна ошибка если вы повторно пытаетесь подгрузить одинаковые данные<br>
      (ничего страшного, платформа уведомит что строки котороые уже есть в базе данных - не сохранились)
    </p>
    <p><span style="color: orange">Внимание!</span> Для заполнения себестоимости и отображения фотографий и названий в детальной статистике, зайтиде в товары и подтяните их из ВБ</p>
    <h1>Как добавить себестоимость товара</h1>
    <p>1. Перейдите в Товары<br>
      2. Нажмите кнопку <span class="bi bi-arrow-clockwise bold"></span> - это подгрузит информацию о ваших карточках в нашу систему.<br>
      3. Справа каждой карточки есть кнопка "сохранить" <span class="fa fa-floppy-o mr-auto button_paid_save"></span> и "редактировать" <span class="bi bi-pencil-square mr-auto button_paid_edit"></span><br>
      4. Нажмите <span class="bi bi-pencil-square mr-auto button_paid_edit"></span> и введите сумму себестоимости 1 единицы товара и нажмите <span class="fa fa-floppy-o mr-auto button_paid_save"></span>
    </p>
    <p><span style="color: green">Готово!</span> Теперь эти данные будут учитываться при расчёте статистик</p>
    <br>
    <h5 style="color: red">Так же, не забывайте добавлять налоговый % в вашем личном кабинете !</h5>
  </div>
</template>

<style scoped>
/* Пустой - все стили в site.css */
</style>